{
  "log": {
    "disabled": false,
    "level": "info",
    "timestamp": true
  },
  "dns": {
    "servers": [
      {
        "tag": "proxy_dns",
        "address": "tls://8.8.8.8/dns-query",
        "detour": "select"
      },
      {
        "tag": "local_dns",
        "address": "h3://223.5.5.5/dns-query",
        "detour": "direct"
      },
      {
        "tag": "reject",
        "address": "rcode://refused"
      },
      {
        "tag": "fake_ip",
        "address": "fakeip"
      }
    ],
    "rules": [
      {
        "outbound": "any",
        "server": "local_dns",
        "disable_cache": true
      },
      {
        "clash_mode": "Global",
        "server": "proxy_dns"
      },
      {
        "clash_mode": "Direct",
        "server": "local_dns"
      },
      {
        "rule_set": "geosite-cn",
        "server": "local_dns"
      },
      {
        "rule_set": "geosite-geolocation-!cn",
        "server": "proxy_dns"
      },
      {
        "rule_set": "geosite-geolocation-!cn",
        "query_type": [
          "A",
          "AAAA"
        ],
        "server": "fake_ip"
      }
    ],
    "final": "proxy_dns",
    "independent_cache": true,
    "fakeip": {
      "enabled": true,
      "inet4_range": "198.18.0.0/15",
      "inet6_range": "fc00::/18"
    }
  },
  "ntp": {
    "detour": "direct",
    "enabled": true,
    "server": "time.apple.com",
    "server_port": 123,
    "interval": "30m"
  },
  "inbounds": [
    {
      "sniff": true,
      "sniff_override_destination": true,
      "domain_strategy": "prefer_ipv4",
      "type": "tun",
      "inet4_address": "172.16.0.1/30",
      "inet6_address": "2001:0470:f9da:fdfa::1/64",
      "mtu": 9000,
      "auto_route": true,
      "strict_route": true,
      "endpoint_independent_nat": true
    }
  ],
  "outbounds": [
    {
      "type": "selector",
      "tag": "select",
      "outbounds": [
        "url-test",
        "🇺🇸_定制专线：@Alin006Bot_1",
        "🥦48@anzhuoapk",
        "DE 原生IP C",
        "🍑35@anzhuoapk",
        "DE 原生IP A",
        "🥦39@anzhuoapk",
        "US 原生IP A",
        "🥦68@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1A_1",
        "🥦30@anzhuoapk",
        "🇺🇸TG搜@anzhuoapk 每天更新 福利不断_1",
        "🍑34@anzhuoapk_1",
        "🇷🇺 俄罗斯-喀山-HY-001-2C",
        "🥦32@anzhuoapk",
        "🇺🇸_定制专线：@Alin006Bot_2",
        "🥦40@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1G",
        "🍑34@anzhuoapk_2",
        "🇷🇺 俄罗斯-喀山-HY-001-1A_2",
        "🥦29@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1x",
        "🇷🇺 俄罗斯-1A",
        "nl_amsterdam",
        "🇷🇺 俄罗斯-1F",
        "🇭🇰 中国-香港-HY-002-1A_1",
        "🇬🇧 英国-伦敦-HY-001-1C",
        "俄罗斯-喀山-HY-001",
        "🥦49@anzhuoapk",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-1L",
        "🇭🇰 中国-香港-HY-002-1A_2",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-1K",
        "🥦44@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1C",
        "🇺🇸 美国 01 电信推荐-1A",
        "US 原生IP B",
        "🇬🇧 英国-伦敦-HY-001-2C",
        "俄罗斯-莫斯科-HY-003",
        "🇬🇧 英国-伦敦-HY-001-1L",
        "🇭🇰 中国-香港-HY-002-1L",
        "更多福利直达👉 https://t.me/anzhuoapk_1",
        "🇺🇸 美国 01 电信推荐-1C",
        "🇬🇧 英国-伦敦-HY-001-1R",
        "🇷🇺 俄罗斯-1C",
        "更多福利直达👉 https://t.me/anzhuoapk_2",
        "更多福利直达👉 https://t.me/anzhuoapk_3",
        "🇺🇸 美国 01 电信推荐-1G",
        "🇫🇷 法国 01 联通推荐-1F",
        "🥦36@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-2J",
        "🇭🇰 中国-香港-HY-002-1P_1",
        "🇺🇸 美国 01 电信推荐-1B",
        "🇬🇧 英国-伦敦-HY-001-1E",
        "🇫🇷 法国 01 联通推荐-1B",
        "🇭🇰 中国-香港-HY-002-2Q",
        "更多福利直达👉 https://t.me/anzhuoapk_4",
        "🇺🇸 美国 01 电信推荐-1D",
        "🇺🇸 美国 01 电信推荐-1F",
        "🇺🇸 美国 01 电信推荐-1H",
        "🥦34@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-2A",
        "🇯🇵JP_@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-1U_1",
        "🍐6@anzhuoapk",
        "🇬🇧 英国-伦敦-HY-001-1P_1",
        "🇭🇰 中国-香港-HY-002-1M",
        "🇭🇰 中国-香港-HY-002-1P_2",
        "🇫🇷 法国 01 联通推荐-1H",
        "🇬🇧 英国-伦敦-HY-001-1A",
        "🇭🇰 香港-1H",
        "🇭🇰 中国-香港-HY-002-1Z",
        "🇭🇰 中国-香港-HY-002-2D",
        "🇬🇧 英国-伦敦-HY-001-1P_2",
        "🇭🇰 中国-香港-HY-002-1W",
        "HK带宽200M 无限流量TG搜@anzhuoapk 每天更新 福利不断",
        "新加坡-HY-002",
        "🇸🇬 新加坡-HY-002-2I",
        "🇭🇰 中国-香港-HY-002-1U_2",
        "🇺🇸TG搜@anzhuoapk 每天更新 福利不断_2",
        "🇸🇬 新加坡-HY-002-1H",
        "🇷🇺 俄罗斯-喀山-HY-001-1E",
        "🇷🇺 俄罗斯-喀山-HY-001-1I",
        "TG搜@anzhuoapk 每天更新 福利不断_1",
        "中国-香港-HY-002",
        "俄罗斯-莫斯科-HY-001",
        "TG搜@anzhuoapk 每天更新 福利不断_2",
        "TG搜@anzhuoapk 每天更新 福利不断_3",
        "🇸🇬 新加坡-HY-002-1I",
        "🇸🇬 新加坡-HY-002-1N",
        "🇸🇬 新加坡-HY-002-1O",
        "🇸🇬 新加坡-HY-002-1A",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1A",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1I",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1K",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1O",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1E",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1H",
        "🇺🇸_定制专线：@Alin006Bot_3",
        "🇺🇸_定制专线：@Alin006Bot_4",
        "美国-18.8MB/s",
        "新加坡-63.6MB/s",
        "中转节点-19.41MB/s",
        "🇯🇵 日本-1F",
        "🇯🇵 日本-1C",
        "🇯🇵 日本-1B",
        "🇬🇧 英国-伦敦-HY-001-1D_1",
        "🇭🇰 香港-1B",
        "🇬🇧 英国-伦敦-HY-001-2J",
        "🇭🇰 香港-1C",
        "🇯🇵 日本-1A",
        "🇭🇰 中国-香港-HY-002-2S",
        "🇭🇰 香港-1D",
        "更多福利直达👉 https://t.me/anzhuoapk_5",
        "🇭🇰 香港-1F",
        "🇬🇧 英国-伦敦-HY-001-1M",
        "🇬🇧 英国-伦敦-HY-001-2A",
        "🇬🇧 英国-伦敦-HY-001-1Q",
        "🇬🇧 英国-伦敦-HY-001-2S",
        "🇭🇰 香港-1A",
        "🇭🇰 香港-1I",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-2D",
        "🇬🇧 英国-伦敦-HY-001-1K_1",
        "🇬🇧 英国-伦敦-HY-001-1H",
        "🇭🇰 中国-香港-HY-002-1D_1",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-1Z",
        "🇬🇧 英国-伦敦-HY-001-2P",
        "🇬🇧 英国-伦敦-HY-001-1N",
        "🇬🇧 英国-伦敦-HY-001-1J",
        "🇭🇰 中国-香港-HY-002-1x",
        "🇭🇰 中国-香港-HY-002-2P",
        "🇬🇧 英国-伦敦-HY-001-1D_2",
        "🇭🇰 中国-香港-HY-002-1J",
        "🥦45@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-1B",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-2F",
        "🫐73@anzhuoapk",
        "🇬🇧 英国-伦敦-HY-001-1K_2",
        "🍐15@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-1D_2",
        "电报群: https://t.me/emovpn x1",
        "「加入会员解锁流媒体」x5",
        "「🇮🇳」EMO | 牛油果 x5",
        "「🇺🇸」EMO | 芝麻蕉 x1",
        "「🇸🇬」EMO | 西贡蕉 x1",
        "「🇺🇸」EMO | 天元果 x1",
        "「🇬🇧」EMO | 红富士 x1",
        "「🇫🇷」EMO | 冰糖心 x1",
        "「🇩🇪」EMO | 冰灵果 x1",
        "2024年12月4日_1",
        "2024年12月4日_2",
        "2024年12月4日_3",
        "2024年12月4日_4",
        "2024年12月4日_5",
        "2024年12月4日_6",
        "2024年12月4日_7",
        "2024年12月4日_8",
        "2024年12月4日_9",
        "2024年12月4日_10",
        "2024年12月4日_11",
        "2024年12月4日_12",
        "2024年12月4日_13",
        "2024年12月4日_14",
        "2024年12月4日_15",
        "2024年12月4日_16",
        "2024年12月4日_17",
        "2024年12月4日_18",
        "2024年12月4日_19",
        "2024年12月4日_20",
        "2024年12月4日_21",
        "2024年12月4日_22",
        "2024年12月4日_23",
        "2024年12月4日_24",
        "2024年12月4日_25",
        "2024年12月4日_26",
        "2024年12月4日_27",
        "2024年12月4日_28",
        "2024年12月4日_29",
        "2024年12月4日_30",
        "2024年12月4日_31",
        "2024年12月4日_32",
        "2024年12月4日_33",
        "2024年12月4日_34",
        "2024年12月4日_35",
        "2024年12月4日_36",
        "2024年12月4日_37",
        "2024年12月4日_38",
        "2024年12月4日_39",
        "2024年12月4日_40",
        "2024年12月4日_41",
        "2024年12月4日_42",
        "2024年12月4日_43",
        "2024年12月4日_44",
        "2024年12月4日_45",
        "2024年12月4日_46",
        "2024年12月4日_47",
        "2024年12月4日_48",
        "2024年12月4日_49",
        "2024年12月4日_50",
        "2024年12月4日_51",
        "2024年12月4日_52",
        "2024年12月4日_53",
        "2024年12月4日_54",
        "2024年12月4日_55",
        "2024年12月4日_56",
        "2024年12月4日_57",
        "2024年12月4日_58",
        "2024年12月4日_59",
        "2024年12月4日_60",
        "2024年12月4日_61",
        "2024年12月4日_62",
        "2024年12月4日_63",
        "2024年12月4日_64",
        "2024年12月4日_65",
        "2024年12月4日_66",
        "2024年12月4日_67",
        "2024年12月4日_68",
        "2024年12月4日_69",
        "2024年12月4日_70",
        "2024年12月4日_71",
        "2024年12月4日_72",
        "2024年12月4日_73",
        "2024年12月4日_74",
        "2024年12月4日_75",
        "2024年12月4日_76",
        "2024年12月4日_77",
        "2024年12月4日_78",
        "2024年12月4日_79",
        "2024年12月4日_80",
        "2024年12月4日_81",
        "2024年12月4日_82",
        "2024年12月4日_83",
        "2024年12月4日_84",
        "2024年12月4日_85",
        "2024年12月4日_86",
        "2024年12月4日_87",
        "2024年12月4日_88",
        "2024年12月4日_89",
        "2024年12月4日_90",
        "2024年12月4日_91",
        "2024年12月4日_92",
        "2024年12月4日_93",
        "2024年12月4日_94",
        "2024年12月4日_95",
        "2024年12月4日_96",
        "2024年12月4日_97",
        "2024年12月4日_98",
        "2024年12月4日_99",
        "2024年12月4日_100",
        "2024年12月4日_101",
        "2024年12月4日_102",
        "2024年12月4日_103",
        "2024年12月4日_104",
        "2024年12月4日_105",
        "2024年12月4日_106",
        "2024年12月4日_107",
        "2024年12月4日_108",
        "2024年12月4日_109",
        "2024年12月4日_110",
        "2024年12月4日_111",
        "2024年12月4日_112",
        "2024年12月4日_113",
        "2024年12月4日_114",
        "2024年12月4日_115",
        "2024年12月4日_116",
        "2024年12月4日_117",
        "2024年12月4日_118",
        "2024年12月4日_119",
        "2024年12月4日_120",
        "2024年12月4日_121",
        "2024年12月4日_122",
        "2024年12月4日_123",
        "2024年12月4日_124",
        "2024年12月4日_125",
        "2024年12月4日_126",
        "2024年12月4日_127",
        "2024年12月4日_128",
        "2024年12月4日_129",
        "2024年12月4日_130",
        "2024年12月4日_131",
        "2024年12月4日_132",
        "2024年12月4日_133",
        "2024年12月4日_134",
        "2024年12月4日_135",
        "2024年12月4日_136",
        "2024年12月4日_137",
        "2024年12月4日_138"
      ],
      "default": "url-test"
    },
    {
      "type": "urltest",
      "tag": "url-test",
      "outbounds": [
        "🇺🇸_定制专线：@Alin006Bot_1",
        "🥦48@anzhuoapk",
        "DE 原生IP C",
        "🍑35@anzhuoapk",
        "DE 原生IP A",
        "🥦39@anzhuoapk",
        "US 原生IP A",
        "🥦68@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1A_1",
        "🥦30@anzhuoapk",
        "🇺🇸TG搜@anzhuoapk 每天更新 福利不断_1",
        "🍑34@anzhuoapk_1",
        "🇷🇺 俄罗斯-喀山-HY-001-2C",
        "🥦32@anzhuoapk",
        "🇺🇸_定制专线：@Alin006Bot_2",
        "🥦40@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1G",
        "🍑34@anzhuoapk_2",
        "🇷🇺 俄罗斯-喀山-HY-001-1A_2",
        "🥦29@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1x",
        "🇷🇺 俄罗斯-1A",
        "nl_amsterdam",
        "🇷🇺 俄罗斯-1F",
        "🇭🇰 中国-香港-HY-002-1A_1",
        "🇬🇧 英国-伦敦-HY-001-1C",
        "俄罗斯-喀山-HY-001",
        "🥦49@anzhuoapk",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-1L",
        "🇭🇰 中国-香港-HY-002-1A_2",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-1K",
        "🥦44@anzhuoapk",
        "🇷🇺 俄罗斯-喀山-HY-001-1C",
        "🇺🇸 美国 01 电信推荐-1A",
        "US 原生IP B",
        "🇬🇧 英国-伦敦-HY-001-2C",
        "俄罗斯-莫斯科-HY-003",
        "🇬🇧 英国-伦敦-HY-001-1L",
        "🇭🇰 中国-香港-HY-002-1L",
        "更多福利直达👉 https://t.me/anzhuoapk_1",
        "🇺🇸 美国 01 电信推荐-1C",
        "🇬🇧 英国-伦敦-HY-001-1R",
        "🇷🇺 俄罗斯-1C",
        "更多福利直达👉 https://t.me/anzhuoapk_2",
        "更多福利直达👉 https://t.me/anzhuoapk_3",
        "🇺🇸 美国 01 电信推荐-1G",
        "🇫🇷 法国 01 联通推荐-1F",
        "🥦36@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-2J",
        "🇭🇰 中国-香港-HY-002-1P_1",
        "🇺🇸 美国 01 电信推荐-1B",
        "🇬🇧 英国-伦敦-HY-001-1E",
        "🇫🇷 法国 01 联通推荐-1B",
        "🇭🇰 中国-香港-HY-002-2Q",
        "更多福利直达👉 https://t.me/anzhuoapk_4",
        "🇺🇸 美国 01 电信推荐-1D",
        "🇺🇸 美国 01 电信推荐-1F",
        "🇺🇸 美国 01 电信推荐-1H",
        "🥦34@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-2A",
        "🇯🇵JP_@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-1U_1",
        "🍐6@anzhuoapk",
        "🇬🇧 英国-伦敦-HY-001-1P_1",
        "🇭🇰 中国-香港-HY-002-1M",
        "🇭🇰 中国-香港-HY-002-1P_2",
        "🇫🇷 法国 01 联通推荐-1H",
        "🇬🇧 英国-伦敦-HY-001-1A",
        "🇭🇰 香港-1H",
        "🇭🇰 中国-香港-HY-002-1Z",
        "🇭🇰 中国-香港-HY-002-2D",
        "🇬🇧 英国-伦敦-HY-001-1P_2",
        "🇭🇰 中国-香港-HY-002-1W",
        "HK带宽200M 无限流量TG搜@anzhuoapk 每天更新 福利不断",
        "新加坡-HY-002",
        "🇸🇬 新加坡-HY-002-2I",
        "🇭🇰 中国-香港-HY-002-1U_2",
        "🇺🇸TG搜@anzhuoapk 每天更新 福利不断_2",
        "🇸🇬 新加坡-HY-002-1H",
        "🇷🇺 俄罗斯-喀山-HY-001-1E",
        "🇷🇺 俄罗斯-喀山-HY-001-1I",
        "TG搜@anzhuoapk 每天更新 福利不断_1",
        "中国-香港-HY-002",
        "俄罗斯-莫斯科-HY-001",
        "TG搜@anzhuoapk 每天更新 福利不断_2",
        "TG搜@anzhuoapk 每天更新 福利不断_3",
        "🇸🇬 新加坡-HY-002-1I",
        "🇸🇬 新加坡-HY-002-1N",
        "🇸🇬 新加坡-HY-002-1O",
        "🇸🇬 新加坡-HY-002-1A",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1A",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1I",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1K",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1O",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1E",
        "🇷🇺 俄罗斯-莫斯科-HY-001-1H",
        "🇺🇸_定制专线：@Alin006Bot_3",
        "🇺🇸_定制专线：@Alin006Bot_4",
        "美国-18.8MB/s",
        "新加坡-63.6MB/s",
        "中转节点-19.41MB/s",
        "🇯🇵 日本-1F",
        "🇯🇵 日本-1C",
        "🇯🇵 日本-1B",
        "🇬🇧 英国-伦敦-HY-001-1D_1",
        "🇭🇰 香港-1B",
        "🇬🇧 英国-伦敦-HY-001-2J",
        "🇭🇰 香港-1C",
        "🇯🇵 日本-1A",
        "🇭🇰 中国-香港-HY-002-2S",
        "🇭🇰 香港-1D",
        "更多福利直达👉 https://t.me/anzhuoapk_5",
        "🇭🇰 香港-1F",
        "🇬🇧 英国-伦敦-HY-001-1M",
        "🇬🇧 英国-伦敦-HY-001-2A",
        "🇬🇧 英国-伦敦-HY-001-1Q",
        "🇬🇧 英国-伦敦-HY-001-2S",
        "🇭🇰 香港-1A",
        "🇭🇰 香港-1I",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-2D",
        "🇬🇧 英国-伦敦-HY-001-1K_1",
        "🇬🇧 英国-伦敦-HY-001-1H",
        "🇭🇰 中国-香港-HY-002-1D_1",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-1Z",
        "🇬🇧 英国-伦敦-HY-001-2P",
        "🇬🇧 英国-伦敦-HY-001-1N",
        "🇬🇧 英国-伦敦-HY-001-1J",
        "🇭🇰 中国-香港-HY-002-1x",
        "🇭🇰 中国-香港-HY-002-2P",
        "🇬🇧 英国-伦敦-HY-001-1D_2",
        "🇭🇰 中国-香港-HY-002-1J",
        "🥦45@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-1B",
        "🇷🇺 俄罗斯-圣彼得堡-HY-003-2F",
        "🫐73@anzhuoapk",
        "🇬🇧 英国-伦敦-HY-001-1K_2",
        "🍐15@anzhuoapk",
        "🇭🇰 中国-香港-HY-002-1D_2",
        "电报群: https://t.me/emovpn x1",
        "「加入会员解锁流媒体」x5",
        "「🇮🇳」EMO | 牛油果 x5",
        "「🇺🇸」EMO | 芝麻蕉 x1",
        "「🇸🇬」EMO | 西贡蕉 x1",
        "「🇺🇸」EMO | 天元果 x1",
        "「🇬🇧」EMO | 红富士 x1",
        "「🇫🇷」EMO | 冰糖心 x1",
        "「🇩🇪」EMO | 冰灵果 x1",
        "2024年12月4日_1",
        "2024年12月4日_2",
        "2024年12月4日_3",
        "2024年12月4日_4",
        "2024年12月4日_5",
        "2024年12月4日_6",
        "2024年12月4日_7",
        "2024年12月4日_8",
        "2024年12月4日_9",
        "2024年12月4日_10",
        "2024年12月4日_11",
        "2024年12月4日_12",
        "2024年12月4日_13",
        "2024年12月4日_14",
        "2024年12月4日_15",
        "2024年12月4日_16",
        "2024年12月4日_17",
        "2024年12月4日_18",
        "2024年12月4日_19",
        "2024年12月4日_20",
        "2024年12月4日_21",
        "2024年12月4日_22",
        "2024年12月4日_23",
        "2024年12月4日_24",
        "2024年12月4日_25",
        "2024年12月4日_26",
        "2024年12月4日_27",
        "2024年12月4日_28",
        "2024年12月4日_29",
        "2024年12月4日_30",
        "2024年12月4日_31",
        "2024年12月4日_32",
        "2024年12月4日_33",
        "2024年12月4日_34",
        "2024年12月4日_35",
        "2024年12月4日_36",
        "2024年12月4日_37",
        "2024年12月4日_38",
        "2024年12月4日_39",
        "2024年12月4日_40",
        "2024年12月4日_41",
        "2024年12月4日_42",
        "2024年12月4日_43",
        "2024年12月4日_44",
        "2024年12月4日_45",
        "2024年12月4日_46",
        "2024年12月4日_47",
        "2024年12月4日_48",
        "2024年12月4日_49",
        "2024年12月4日_50",
        "2024年12月4日_51",
        "2024年12月4日_52",
        "2024年12月4日_53",
        "2024年12月4日_54",
        "2024年12月4日_55",
        "2024年12月4日_56",
        "2024年12月4日_57",
        "2024年12月4日_58",
        "2024年12月4日_59",
        "2024年12月4日_60",
        "2024年12月4日_61",
        "2024年12月4日_62",
        "2024年12月4日_63",
        "2024年12月4日_64",
        "2024年12月4日_65",
        "2024年12月4日_66",
        "2024年12月4日_67",
        "2024年12月4日_68",
        "2024年12月4日_69",
        "2024年12月4日_70",
        "2024年12月4日_71",
        "2024年12月4日_72",
        "2024年12月4日_73",
        "2024年12月4日_74",
        "2024年12月4日_75",
        "2024年12月4日_76",
        "2024年12月4日_77",
        "2024年12月4日_78",
        "2024年12月4日_79",
        "2024年12月4日_80",
        "2024年12月4日_81",
        "2024年12月4日_82",
        "2024年12月4日_83",
        "2024年12月4日_84",
        "2024年12月4日_85",
        "2024年12月4日_86",
        "2024年12月4日_87",
        "2024年12月4日_88",
        "2024年12月4日_89",
        "2024年12月4日_90",
        "2024年12月4日_91",
        "2024年12月4日_92",
        "2024年12月4日_93",
        "2024年12月4日_94",
        "2024年12月4日_95",
        "2024年12月4日_96",
        "2024年12月4日_97",
        "2024年12月4日_98",
        "2024年12月4日_99",
        "2024年12月4日_100",
        "2024年12月4日_101",
        "2024年12月4日_102",
        "2024年12月4日_103",
        "2024年12月4日_104",
        "2024年12月4日_105",
        "2024年12月4日_106",
        "2024年12月4日_107",
        "2024年12月4日_108",
        "2024年12月4日_109",
        "2024年12月4日_110",
        "2024年12月4日_111",
        "2024年12月4日_112",
        "2024年12月4日_113",
        "2024年12月4日_114",
        "2024年12月4日_115",
        "2024年12月4日_116",
        "2024年12月4日_117",
        "2024年12月4日_118",
        "2024年12月4日_119",
        "2024年12月4日_120",
        "2024年12月4日_121",
        "2024年12月4日_122",
        "2024年12月4日_123",
        "2024年12月4日_124",
        "2024年12月4日_125",
        "2024年12月4日_126",
        "2024年12月4日_127",
        "2024年12月4日_128",
        "2024年12月4日_129",
        "2024年12月4日_130",
        "2024年12月4日_131",
        "2024年12月4日_132",
        "2024年12月4日_133",
        "2024年12月4日_134",
        "2024年12月4日_135",
        "2024年12月4日_136",
        "2024年12月4日_137",
        "2024年12月4日_138"
      ],
      "url": "https://www.gstatic.com/generate_204",
      "interval": "3m",
      "tolerance": 50
    },
    {
      "type": "shadowsocks",
      "tag": "🇺🇸_定制专线：@Alin006Bot_1",
      "server": "54.203.119.192",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "hysteria2",
      "tag": "🥦48@anzhuoapk",
      "server": "104.168.148.94",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "DE 原生IP C",
      "server": "94.159.109.188",
      "server_port": 8443,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "hysteria2",
      "tag": "🍑35@anzhuoapk",
      "server": "207.211.189.252",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "DE 原生IP A",
      "server": "188.68.49.1",
      "server_port": 2053,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "hysteria2",
      "tag": "🥦39@anzhuoapk",
      "server": "37.123.193.73",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "US 原生IP A",
      "server": "192.227.153.119",
      "server_port": 8443,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "vless",
      "tag": "🥦68@anzhuoapk",
      "server": "185.146.173.58",
      "server_port": 8080,
      "uuid": "cea06199-e51d-4a53-b7c8-195b75ab3f1d",
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/servernett",
        "headers": {
          "host": "lc86.lebasnoo.ir."
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-1A_1",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "3ac518d4-4917-4a91-82bb-997fa47a9778"
    },
    {
      "type": "hysteria2",
      "tag": "🥦30@anzhuoapk",
      "server": "us12.wish.ml",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "🇺🇸TG搜@anzhuoapk 每天更新 福利不断_1",
      "server": "66.135.11.68",
      "server_port": 443,
      "obfs": {
        "type": "salamander",
        "password": "13f7ba5f"
      },
      "password": "4e9ee29b39a28277"
    },
    {
      "type": "hysteria2",
      "tag": "🍑34@anzhuoapk_1",
      "server": "207.211.176.63",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-2C",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "2f63e9c9-bd96-4a0e-a097-22935d215b30"
    },
    {
      "type": "hysteria2",
      "tag": "🥦32@anzhuoapk",
      "server": "149.28.32.64",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "shadowsocks",
      "tag": "🇺🇸_定制专线：@Alin006Bot_2",
      "server": "35.94.117.219",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "hysteria2",
      "tag": "🥦40@anzhuoapk",
      "server": "209.141.56.5",
      "server_port": 456,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-1G",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "cf444a13-b002-459a-b947-1c89f0074e7e"
    },
    {
      "type": "hysteria2",
      "tag": "🍑34@anzhuoapk_2",
      "server": "us13.wish.ml",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-1A_2",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "1a5df051-c00d-4728-8ecc-a5d02f2c094e"
    },
    {
      "type": "hysteria2",
      "tag": "🥦29@anzhuoapk",
      "server": "204.216.108.5",
      "server_port": 2024,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-1x",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "ccb3da11-e925-4eae-b666-ed6a78078c6e"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-1A",
      "server": "45.140.169.231",
      "server_port": 8080,
      "password": "0bc4aacd-5883-42db-9624-72342b07e361"
    },
    {
      "type": "shadowsocks",
      "tag": "nl_amsterdam",
      "server": "149.34.244.77",
      "server_port": 443,
      "method": "aes-128-gcm",
      "password": "shadowsocks",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-1F",
      "server": "45.140.169.231",
      "server_port": 8080,
      "password": "1a74c596-0ace-446e-8fc2-3bf17b754550"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1A_1",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "e6df82d4-a551-4755-aee2-89270929280c"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1C",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "049a0657-0637-4176-ad3f-6088764f4376"
    },
    {
      "type": "hysteria2",
      "tag": "俄罗斯-喀山-HY-001",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "28f6d888-cbc5-4210-8cd2-b40cf566d9a8"
    },
    {
      "type": "hysteria2",
      "tag": "🥦49@anzhuoapk",
      "server": "103.235.18.69",
      "server_port": 444,
      "password": "system.system"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-圣彼得堡-HY-003-1L",
      "server": "195.58.48.220",
      "server_port": 80,
      "obfs": {
        "type": "salamander",
        "password": "MzliZDM5MDFhYmFlNTAyMA=="
      },
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1A_2",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "e80d7afd-1588-40ec-b4bd-c6a4a4ae9f6b"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-圣彼得堡-HY-003-1K",
      "server": "195.58.48.220",
      "server_port": 80,
      "obfs": {
        "type": "salamander",
        "password": "MzliZDM5MDFhYmFlNTAyMA=="
      },
      "password": "4f4b8d86-548e-45ee-8b1c-afc5871a8da3"
    },
    {
      "type": "hysteria2",
      "tag": "🥦44@anzhuoapk",
      "server": "167.234.249.46",
      "server_port": 444,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-1C",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "c9e76d3e-ec9d-425a-9a35-83c8b4f20ef7"
    },
    {
      "type": "vless",
      "tag": "🇺🇸 美国 01 电信推荐-1A",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "0bc4aacd-5883-42db-9624-72342b07e361",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "qq"
        },
        "reality": {
          "enabled": true,
          "public_key": "8233FxCRw1a_aCJ8d1HwHBMD_fABUNNW7rsrFe3vK0s",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "US 原生IP B",
      "server": "38.175.201.128",
      "server_port": 8443,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-2C",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "98810ef1-28c5-4ad6-92cc-aa09b2c96024"
    },
    {
      "type": "hysteria2",
      "tag": "俄罗斯-莫斯科-HY-003",
      "server": "176.32.35.198",
      "server_port": 8307,
      "obfs": {
        "type": "salamander",
        "password": "NDQyMDdkMTEzNDRmMDAxYg=="
      },
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1L",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "eb1e4c44-a463-4d46-9232-789bfc6363da"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1L",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "更多福利直达👉 https://t.me/anzhuoapk_1",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "fcdf8d1e-f3a0-426b-a1e4-b5ef7aeb32de"
    },
    {
      "type": "vless",
      "tag": "🇺🇸 美国 01 电信推荐-1C",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "681d7fb9-71b0-4816-b61a-23d23cb64fba",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "ios"
        },
        "reality": {
          "enabled": true,
          "public_key": "8233FxCRw1a_aCJ8d1HwHBMD_fABUNNW7rsrFe3vK0s",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1R",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "77efa9ba-588f-4e3a-b2a4-5017fed70b33"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-1C",
      "server": "45.140.169.231",
      "server_port": 8080,
      "password": "681d7fb9-71b0-4816-b61a-23d23cb64fba"
    },
    {
      "type": "hysteria2",
      "tag": "更多福利直达👉 https://t.me/anzhuoapk_2",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "900dc356-7db5-403b-96b3-c943824443ee"
    },
    {
      "type": "hysteria2",
      "tag": "更多福利直达👉 https://t.me/anzhuoapk_3",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "5b78c441-c626-40d5-8681-8f1275117432"
    },
    {
      "type": "vless",
      "tag": "🇺🇸 美国 01 电信推荐-1G",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "ca803640-e792-4e31-8e81-8891d3474f38",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        },
        "reality": {
          "enabled": true,
          "public_key": "8233FxCRw1a_aCJ8d1HwHBMD_fABUNNW7rsrFe3vK0s",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "vless",
      "tag": "🇫🇷 法国 01 联通推荐-1F",
      "server": "frankfurt.faforex.eu.org",
      "server_port": 18443,
      "uuid": "1a74c596-0ace-446e-8fc2-3bf17b754550",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "safari"
        },
        "reality": {
          "enabled": true,
          "public_key": "bRUCz8KaceEKnBFT5V7czJj1t0OAu_nbKnMyVfyeK1I",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "🥦36@anzhuoapk",
      "server": "129.153.85.205",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-2J",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "d43690d7-93df-4b1a-bcf5-09137e4c1490"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1P_1",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "c801f576-1531-4aa0-a884-25146b988814"
    },
    {
      "type": "vless",
      "tag": "🇺🇸 美国 01 电信推荐-1B",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "674f839f-b3ac-4de0-b890-ed25a44104bf",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "firefox"
        },
        "reality": {
          "enabled": true,
          "public_key": "8233FxCRw1a_aCJ8d1HwHBMD_fABUNNW7rsrFe3vK0s",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1E",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "575f8255-fc62-47a3-bdba-17be9fb5aa1a"
    },
    {
      "type": "vless",
      "tag": "🇫🇷 法国 01 联通推荐-1B",
      "server": "frankfurt.faforex.eu.org",
      "server_port": 18443,
      "uuid": "674f839f-b3ac-4de0-b890-ed25a44104bf",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        },
        "reality": {
          "enabled": true,
          "public_key": "bRUCz8KaceEKnBFT5V7czJj1t0OAu_nbKnMyVfyeK1I",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-2Q",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "40d0aed3-d147-4a03-9f93-4b2ed626923a"
    },
    {
      "type": "hysteria2",
      "tag": "更多福利直达👉 https://t.me/anzhuoapk_4",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "588e7060-7953-47b5-b438-c52979334e8f"
    },
    {
      "type": "vless",
      "tag": "🇺🇸 美国 01 电信推荐-1D",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "2c653b56-0dc8-4b44-9352-c4c837a841bd",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "safari"
        },
        "reality": {
          "enabled": true,
          "public_key": "8233FxCRw1a_aCJ8d1HwHBMD_fABUNNW7rsrFe3vK0s",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "vless",
      "tag": "🇺🇸 美国 01 电信推荐-1F",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "1a74c596-0ace-446e-8fc2-3bf17b754550",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "edge"
        },
        "reality": {
          "enabled": true,
          "public_key": "8233FxCRw1a_aCJ8d1HwHBMD_fABUNNW7rsrFe3vK0s",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "vless",
      "tag": "🇺🇸 美国 01 电信推荐-1H",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "5a10a9a9-5956-408f-8b68-9cbcceef62ea",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "safari"
        },
        "reality": {
          "enabled": true,
          "public_key": "8233FxCRw1a_aCJ8d1HwHBMD_fABUNNW7rsrFe3vK0s",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "🥦34@anzhuoapk",
      "server": "66.103.200.109",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-2A",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "56701d98-27dd-4e55-ad42-940e3892391b"
    },
    {
      "type": "hysteria2",
      "tag": "🇯🇵JP_@anzhuoapk",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "2c653b56-0dc8-4b44-9352-c4c837a841bd"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1U_1",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "6cfde9b4-6a04-4c51-9bb9-30b33dc2dd9d"
    },
    {
      "type": "hysteria2",
      "tag": "🍐6@anzhuoapk",
      "server": "107.174.253.29",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1P_1",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "8249831b-ee9d-4fce-a47c-f186e9153bd3"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1M",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "b1292636-c77a-4c3f-a379-c7a476aa8650"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1P_2",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "8249831b-ee9d-4fce-a47c-f186e9153bd3"
    },
    {
      "type": "vless",
      "tag": "🇫🇷 法国 01 联通推荐-1H",
      "server": "frankfurt.faforex.eu.org",
      "server_port": 18443,
      "uuid": "5a10a9a9-5956-408f-8b68-9cbcceef62ea",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "firefox"
        },
        "reality": {
          "enabled": true,
          "public_key": "bRUCz8KaceEKnBFT5V7czJj1t0OAu_nbKnMyVfyeK1I",
          "short_id": "e6658462"
        }
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1A",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "e80d7afd-1588-40ec-b4bd-c6a4a4ae9f6b"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 香港-1H",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "ca803640-e792-4e31-8e81-8891d3474f38"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1Z",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "900dc356-7db5-403b-96b3-c943824443ee"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-2D",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "e6c151a7-d2ec-4a01-a68b-d10590d591e2"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1P_2",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "c801f576-1531-4aa0-a884-25146b988814"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1W",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "750c1a7d-cb14-4b12-a817-71d86d02c1e6"
    },
    {
      "type": "hysteria2",
      "tag": "HK带宽200M 无限流量TG搜@anzhuoapk 每天更新 福利不断",
      "server": "212.192.13.222",
      "server_port": 1995,
      "password": "0d42717f"
    },
    {
      "type": "hysteria2",
      "tag": "新加坡-HY-002",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "28f6d888-cbc5-4210-8cd2-b40cf566d9a8"
    },
    {
      "type": "hysteria2",
      "tag": "🇸🇬 新加坡-HY-002-2I",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "37f1fb58-f57c-490a-b17f-9f7db5d6c486"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1U_2",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "377dfd01-2d1c-4c34-b2c9-e737e075595b"
    },
    {
      "type": "hysteria2",
      "tag": "🇺🇸TG搜@anzhuoapk 每天更新 福利不断_2",
      "server": "70.34.207.153",
      "server_port": 443,
      "obfs": {
        "type": "salamander",
        "password": "d2648ec2"
      },
      "password": "18240b2dfdd76484"
    },
    {
      "type": "hysteria2",
      "tag": "🇸🇬 新加坡-HY-002-1H",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "efa0dd5a-be97-469f-9679-aac4528cfbde"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-1E",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "279d86c4-083c-4667-b25e-710a55f49f0d"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-喀山-HY-001-1I",
      "server": "176.32.33.158",
      "server_port": 1200,
      "obfs": {
        "type": "salamander",
        "password": "NDhhNmY5YTY0MGYzOTgxYQ=="
      },
      "password": "24f1bf50-3817-42e5-956a-a3af271274e1"
    },
    {
      "type": "hysteria2",
      "tag": "TG搜@anzhuoapk 每天更新 福利不断_1",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "中国-香港-HY-002",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "俄罗斯-莫斯科-HY-001",
      "server": "176.32.35.194",
      "server_port": 3323,
      "obfs": {
        "type": "salamander",
        "password": "MGJiYThkMjgwNDE1Y2FkMg=="
      },
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "TG搜@anzhuoapk 每天更新 福利不断_2",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "d5285e2d-f110-4bd9-a15a-36febf08428d"
    },
    {
      "type": "hysteria2",
      "tag": "TG搜@anzhuoapk 每天更新 福利不断_3",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "🇸🇬 新加坡-HY-002-1I",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "8672cafa-5333-4768-b38c-032bbf820839"
    },
    {
      "type": "hysteria2",
      "tag": "🇸🇬 新加坡-HY-002-1N",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "e2f90161-2f34-41c3-a144-d441199772e7"
    },
    {
      "type": "hysteria2",
      "tag": "🇸🇬 新加坡-HY-002-1O",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "8497d432-2a53-4ea2-8963-a19298a9c7fb"
    },
    {
      "type": "hysteria2",
      "tag": "🇸🇬 新加坡-HY-002-1A",
      "server": "103.136.68.92",
      "server_port": 3307,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "e6df82d4-a551-4755-aee2-89270929280c"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-莫斯科-HY-001-1A",
      "server": "176.32.35.194",
      "server_port": 3323,
      "obfs": {
        "type": "salamander",
        "password": "MGJiYThkMjgwNDE1Y2FkMg=="
      },
      "password": "e6df82d4-a551-4755-aee2-89270929280c"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-莫斯科-HY-001-1I",
      "server": "176.32.35.194",
      "server_port": 3323,
      "obfs": {
        "type": "salamander",
        "password": "MGJiYThkMjgwNDE1Y2FkMg=="
      },
      "password": "8672cafa-5333-4768-b38c-032bbf820839"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-莫斯科-HY-001-1K",
      "server": "176.32.35.194",
      "server_port": 3323,
      "obfs": {
        "type": "salamander",
        "password": "MGJiYThkMjgwNDE1Y2FkMg=="
      },
      "password": "4f4b8d86-548e-45ee-8b1c-afc5871a8da3"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-莫斯科-HY-001-1O",
      "server": "176.32.35.194",
      "server_port": 3323,
      "obfs": {
        "type": "salamander",
        "password": "MGJiYThkMjgwNDE1Y2FkMg=="
      },
      "password": "8497d432-2a53-4ea2-8963-a19298a9c7fb"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-莫斯科-HY-001-1E",
      "server": "176.32.35.194",
      "server_port": 3323,
      "obfs": {
        "type": "salamander",
        "password": "MGJiYThkMjgwNDE1Y2FkMg=="
      },
      "password": "c801f576-1531-4aa0-a884-25146b988814"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-莫斯科-HY-001-1H",
      "server": "176.32.35.194",
      "server_port": 3323,
      "obfs": {
        "type": "salamander",
        "password": "MGJiYThkMjgwNDE1Y2FkMg=="
      },
      "password": "1a998188-4dab-46ce-94f6-12f403d43e13"
    },
    {
      "type": "shadowsocks",
      "tag": "🇺🇸_定制专线：@Alin006Bot_3",
      "server": "34.208.196.91",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "🇺🇸_定制专线：@Alin006Bot_4",
      "server": "34.222.145.191",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "美国-18.8MB/s",
      "server": "205.134.180.150",
      "server_port": 443,
      "method": "chacha20-ietf-poly1305",
      "password": "5cp9Z3iWnJZ2",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "新加坡-63.6MB/s",
      "server": "13.229.238.238",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "trojan",
      "tag": "中转节点-19.41MB/s",
      "server": "223.113.54.144",
      "server_port": 17956,
      "password": "QwwHvrnN",
      "tls": {
        "enabled": true,
        "insecure": true
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇯🇵 日本-1F",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "1a74c596-0ace-446e-8fc2-3bf17b754550"
    },
    {
      "type": "hysteria2",
      "tag": "🇯🇵 日本-1C",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "681d7fb9-71b0-4816-b61a-23d23cb64fba"
    },
    {
      "type": "hysteria2",
      "tag": "🇯🇵 日本-1B",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "674f839f-b3ac-4de0-b890-ed25a44104bf"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1D_1",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "c7e48028-17b1-4209-bd1c-bfe44b8183c3"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 香港-1B",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "674f839f-b3ac-4de0-b890-ed25a44104bf"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-2J",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "b009baea-87df-4948-882a-f171dceaff71"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 香港-1C",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "681d7fb9-71b0-4816-b61a-23d23cb64fba"
    },
    {
      "type": "hysteria2",
      "tag": "🇯🇵 日本-1A",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "0bc4aacd-5883-42db-9624-72342b07e361"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-2S",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "69a1d004-de39-44cc-a551-75bf942c2138"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 香港-1D",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "2c653b56-0dc8-4b44-9352-c4c837a841bd"
    },
    {
      "type": "hysteria2",
      "tag": "更多福利直达👉 https://t.me/anzhuoapk_5",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "5a10a9a9-5956-408f-8b68-9cbcceef62ea"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 香港-1F",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "1a74c596-0ace-446e-8fc2-3bf17b754550"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1M",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "cd8c4279-5a82-43ac-bdcf-167112c800c7"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-2A",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "4a11b73a-5efd-47ff-ad17-cee5fd183e71"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1Q",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "9d9d4051-4b6b-47e0-8412-3c1a7ce8bff5"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-2S",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "69a1d004-de39-44cc-a551-75bf942c2138"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 香港-1A",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "0bc4aacd-5883-42db-9624-72342b07e361"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 香港-1I",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "5a10a9a9-5956-408f-8b68-9cbcceef62ea"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-圣彼得堡-HY-003-2D",
      "server": "195.58.48.220",
      "server_port": 80,
      "obfs": {
        "type": "salamander",
        "password": "MzliZDM5MDFhYmFlNTAyMA=="
      },
      "password": "01339738-b37f-408b-a156-ea8065f11e93"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1K_1",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "01339738-b37f-408b-a156-ea8065f11e93"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1H",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "b40ff864-6da9-48b8-869e-1976d150a609"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1D_1",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "c7e48028-17b1-4209-bd1c-bfe44b8183c3"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-圣彼得堡-HY-003-1Z",
      "server": "195.58.48.220",
      "server_port": 80,
      "obfs": {
        "type": "salamander",
        "password": "MzliZDM5MDFhYmFlNTAyMA=="
      },
      "password": "65f7bf2c-e33a-4102-b842-f0be83c31365"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-2P",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "a9f356a3-3161-4edb-9f78-a9cd74f985ce"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1N",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "65f7bf2c-e33a-4102-b842-f0be83c31365"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1J",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "19ef7814-d8df-4ac8-8dff-0966f99ce9e1"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1x",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "13eb73a8-d45f-47d1-872e-da5c4810e153"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-2P",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "a9f356a3-3161-4edb-9f78-a9cd74f985ce"
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1D_2",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "301047a0-93f1-45a2-a268-6e40f29e26c0"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1J",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "🥦45@anzhuoapk",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "6b469585-4a07-4387-89cc-b28da026a9a7"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1B",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "77efa9ba-588f-4e3a-b2a4-5017fed70b33"
    },
    {
      "type": "hysteria2",
      "tag": "🇷🇺 俄罗斯-圣彼得堡-HY-003-2F",
      "server": "195.58.48.220",
      "server_port": 80,
      "obfs": {
        "type": "salamander",
        "password": "MzliZDM5MDFhYmFlNTAyMA=="
      },
      "password": "8497d432-2a53-4ea2-8963-a19298a9c7fb"
    },
    {
      "type": "shadowsocks",
      "tag": "🫐73@anzhuoapk",
      "server": "142.202.48.105",
      "server_port": 5004,
      "method": "aes-256-gcm",
      "password": "g5MeD6Ft3CWlJId",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "hysteria2",
      "tag": "🇬🇧 英国-伦敦-HY-001-1K_2",
      "server": "5.39.254.34",
      "server_port": 5128,
      "obfs": {
        "type": "salamander",
        "password": "ZTg1ZWVjNjAxZmRlNGI5MA=="
      },
      "password": "4f4b8d86-548e-45ee-8b1c-afc5871a8da3"
    },
    {
      "type": "hysteria2",
      "tag": "🍐15@anzhuoapk",
      "server": "45.76.0.86",
      "server_port": 443,
      "obfs": {
        "type": "salamander",
        "password": "4b817757"
      },
      "password": "1f17cdf0578a2860"
    },
    {
      "type": "hysteria2",
      "tag": "🇭🇰 中国-香港-HY-002-1D_2",
      "server": "212.192.15.239",
      "server_port": 1327,
      "obfs": {
        "type": "salamander",
        "password": "Y2JhZTU3ZjE4ZTI0MzRmMQ=="
      },
      "password": "301047a0-93f1-45a2-a268-6e40f29e26c0"
    },
    {
      "type": "vmess",
      "tag": "电报群: https://t.me/emovpn x1",
      "server": "v036.emovpn.xyz",
      "server_port": 443,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v036.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「加入会员解锁流媒体」x5",
      "server": "v002.emovpn.xyz",
      "server_port": 2053,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v002.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「🇮🇳」EMO | 牛油果 x5",
      "server": "v019.emovpn.xyz",
      "server_port": 2087,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v019.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「🇺🇸」EMO | 芝麻蕉 x1",
      "server": "v020.emovpn.xyz",
      "server_port": 8443,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v020.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「🇸🇬」EMO | 西贡蕉 x1",
      "server": "v032.emovpn.xyz",
      "server_port": 8443,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v032.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「🇺🇸」EMO | 天元果 x1",
      "server": "v033.emovpn.xyz",
      "server_port": 443,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v033.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「🇬🇧」EMO | 红富士 x1",
      "server": "v034.emovpn.xyz",
      "server_port": 8443,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v034.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「🇫🇷」EMO | 冰糖心 x1",
      "server": "v035.emovpn.xyz",
      "server_port": 443,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v035.emovpn.xyz"
        }
      }
    },
    {
      "type": "vmess",
      "tag": "「🇩🇪」EMO | 冰灵果 x1",
      "server": "v037.emovpn.xyz",
      "server_port": 8443,
      "uuid": "21cb08d3-d1f4-425e-8f8d-837252ca817a",
      "security": "auto",
      "alter_id": 0,
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/",
        "headers": {
          "host": "v037.emovpn.xyz"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_1",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "2c653b56-0dc8-4b44-9352-c4c837a841bd",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "safari"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_2",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "1a74c596-0ace-446e-8fc2-3bf17b754550",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "edge"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_3",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "0bc4aacd-5883-42db-9624-72342b07e361",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "qq"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_4",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "674f839f-b3ac-4de0-b890-ed25a44104bf",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "firefox"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_5",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "681d7fb9-71b0-4816-b61a-23d23cb64fba",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "ios"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_6",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "ca803640-e792-4e31-8e81-8891d3474f38",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_7",
      "server": "phx-plus-1ddns.faforex.eu.org",
      "server_port": 18443,
      "uuid": "5a10a9a9-5956-408f-8b68-9cbcceef62ea",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "safari"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_8",
      "server": "frankfurt.faforex.eu.org",
      "server_port": 18443,
      "uuid": "1a74c596-0ace-446e-8fc2-3bf17b754550",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "safari"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_9",
      "server": "frankfurt.faforex.eu.org",
      "server_port": 18443,
      "uuid": "674f839f-b3ac-4de0-b890-ed25a44104bf",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_10",
      "server": "frankfurt.faforex.eu.org",
      "server_port": 18443,
      "uuid": "5a10a9a9-5956-408f-8b68-9cbcceef62ea",
      "tls": {
        "enabled": true,
        "utls": {
          "enabled": true,
          "fingerprint": "firefox"
        }
      }
    },
    {
      "type": "vless",
      "tag": "2024年12月4日_11",
      "server": "185.146.173.58",
      "server_port": 8080,
      "uuid": "cea06199-e51d-4a53-b7c8-195b75ab3f1d",
      "tls": {
        "enabled": true
      },
      "transport": {
        "type": "ws",
        "path": "/servernett",
        "headers": {
          "host": "lc86.lebasnoo.ir."
        }
      }
    },
    {
      "type": "trojan",
      "tag": "2024年12月4日_12",
      "server": "223.113.54.144",
      "server_port": 17956,
      "password": "QwwHvrnN",
      "tls": {
        "enabled": true,
        "insecure": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_13",
      "server": "142.202.48.105",
      "server_port": 5004,
      "method": "aes-256-gcm",
      "password": "g5MeD6Ft3CWlJId",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_14",
      "server": "149.34.244.77",
      "server_port": 443,
      "method": "aes-128-gcm",
      "password": "shadowsocks",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_15",
      "server": "34.208.196.91",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_16",
      "server": "54.203.119.192",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_17",
      "server": "35.94.117.219",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_18",
      "server": "34.222.145.191",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_19",
      "server": "205.134.180.150",
      "server_port": 443,
      "method": "chacha20-ietf-poly1305",
      "password": "5cp9Z3iWnJZ2",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "shadowsocks",
      "tag": "2024年12月4日_20",
      "server": "13.229.238.238",
      "server_port": 443,
      "method": "aes-256-cfb",
      "password": "amazonskr05",
      "multiplex": {
        "enabled": true
      }
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_21",
      "server": "45.140.169.231",
      "server_port": 8080,
      "password": "681d7fb9-71b0-4816-b61a-23d23cb64fba"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_22",
      "server": "45.140.169.231",
      "server_port": 8080,
      "password": "1a74c596-0ace-446e-8fc2-3bf17b754550"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_23",
      "server": "45.140.169.231",
      "server_port": 8080,
      "password": "0bc4aacd-5883-42db-9624-72342b07e361"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_24",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "1a74c596-0ace-446e-8fc2-3bf17b754550"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_25",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "a9f356a3-3161-4edb-9f78-a9cd74f985ce"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_26",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "eb1e4c44-a463-4d46-9232-789bfc6363da"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_27",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "e80d7afd-1588-40ec-b4bd-c6a4a4ae9f6b"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_28",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "b009baea-87df-4948-882a-f171dceaff71"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_29",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "01339738-b37f-408b-a156-ea8065f11e93"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_30",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "4a11b73a-5efd-47ff-ad17-cee5fd183e71"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_31",
      "server": "195.58.48.220",
      "server_port": 80,
      "password": "8497d432-2a53-4ea2-8963-a19298a9c7fb"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_32",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "65f7bf2c-e33a-4102-b842-f0be83c31365"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_33",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "575f8255-fc62-47a3-bdba-17be9fb5aa1a"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_34",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "77efa9ba-588f-4e3a-b2a4-5017fed70b33"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_35",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "588e7060-7953-47b5-b438-c52979334e8f"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_36",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "301047a0-93f1-45a2-a268-6e40f29e26c0"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_37",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "4f4b8d86-548e-45ee-8b1c-afc5871a8da3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_38",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "9d9d4051-4b6b-47e0-8412-3c1a7ce8bff5"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_39",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "c7e48028-17b1-4209-bd1c-bfe44b8183c3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_40",
      "server": "195.58.48.220",
      "server_port": 80,
      "password": "01339738-b37f-408b-a156-ea8065f11e93"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_41",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "681d7fb9-71b0-4816-b61a-23d23cb64fba"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_42",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "5a10a9a9-5956-408f-8b68-9cbcceef62ea"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_43",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "19ef7814-d8df-4ac8-8dff-0966f99ce9e1"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_44",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "b40ff864-6da9-48b8-869e-1976d150a609"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_45",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "69a1d004-de39-44cc-a551-75bf942c2138"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_46",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "5b78c441-c626-40d5-8681-8f1275117432"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_47",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "674f839f-b3ac-4de0-b890-ed25a44104bf"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_48",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "2c653b56-0dc8-4b44-9352-c4c837a841bd"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_49",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "ca803640-e792-4e31-8e81-8891d3474f38"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_50",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "0bc4aacd-5883-42db-9624-72342b07e361"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_51",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "0bc4aacd-5883-42db-9624-72342b07e361"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_52",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "1a74c596-0ace-446e-8fc2-3bf17b754550"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_53",
      "server": "141.11.217.113",
      "server_port": 8080,
      "password": "681d7fb9-71b0-4816-b61a-23d23cb64fba"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_54",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "674f839f-b3ac-4de0-b890-ed25a44104bf"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_55",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "69a1d004-de39-44cc-a551-75bf942c2138"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_56",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "8249831b-ee9d-4fce-a47c-f186e9153bd3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_57",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "77efa9ba-588f-4e3a-b2a4-5017fed70b33"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_58",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "c801f576-1531-4aa0-a884-25146b988814"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_59",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "301047a0-93f1-45a2-a268-6e40f29e26c0"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_60",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "13eb73a8-d45f-47d1-872e-da5c4810e153"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_61",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "c7e48028-17b1-4209-bd1c-bfe44b8183c3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_62",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "049a0657-0637-4176-ad3f-6088764f4376"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_63",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_64",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "d43690d7-93df-4b1a-bcf5-09137e4c1490"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_65",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "b1292636-c77a-4c3f-a379-c7a476aa8650"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_66",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "e80d7afd-1588-40ec-b4bd-c6a4a4ae9f6b"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_67",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "8249831b-ee9d-4fce-a47c-f186e9153bd3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_68",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "e6c151a7-d2ec-4a01-a68b-d10590d591e2"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_69",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "c801f576-1531-4aa0-a884-25146b988814"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_70",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "56701d98-27dd-4e55-ad42-940e3892391b"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_71",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "a9f356a3-3161-4edb-9f78-a9cd74f985ce"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_72",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "fcdf8d1e-f3a0-426b-a1e4-b5ef7aeb32de"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_73",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "2c653b56-0dc8-4b44-9352-c4c837a841bd"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_74",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "98810ef1-28c5-4ad6-92cc-aa09b2c96024"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_75",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "900dc356-7db5-403b-96b3-c943824443ee"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_76",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "40d0aed3-d147-4a03-9f93-4b2ed626923a"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_77",
      "server": "5.39.254.34",
      "server_port": 5128,
      "password": "cd8c4279-5a82-43ac-bdcf-167112c800c7"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_78",
      "server": "195.58.48.220",
      "server_port": 80,
      "password": "65f7bf2c-e33a-4102-b842-f0be83c31365"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_79",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "6cfde9b4-6a04-4c51-9bb9-30b33dc2dd9d"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_80",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "900dc356-7db5-403b-96b3-c943824443ee"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_81",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "750c1a7d-cb14-4b12-a817-71d86d02c1e6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_82",
      "server": "23.26.34.209",
      "server_port": 8080,
      "password": "5a10a9a9-5956-408f-8b68-9cbcceef62ea"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_83",
      "server": "103.235.18.69",
      "server_port": 444,
      "password": "system.system"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_84",
      "server": "37.123.193.73",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_85",
      "server": "107.174.253.29",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_86",
      "server": "66.103.200.109",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_87",
      "server": "209.141.56.5",
      "server_port": 456,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_88",
      "server": "129.153.85.205",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_89",
      "server": "207.211.176.63",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_90",
      "server": "149.28.32.64",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_91",
      "server": "us13.wish.ml",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_92",
      "server": "us12.wish.ml",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_93",
      "server": "207.211.189.252",
      "server_port": 30102,
      "password": "4453aa95-c236-46a1-8066-8145ab8ebee6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_94",
      "server": "45.76.0.86",
      "server_port": 443,
      "obfs": {
        "type": "salamander",
        "password": "4b817757"
      },
      "password": "1f17cdf0578a2860"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_95",
      "server": "204.216.108.5",
      "server_port": 2024,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_96",
      "server": "104.168.148.94",
      "server_port": 443,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_97",
      "server": "167.234.249.46",
      "server_port": 444,
      "password": "sysadmin.sysadmin"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_98",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "6b469585-4a07-4387-89cc-b28da026a9a7"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_99",
      "server": "212.192.13.222",
      "server_port": 1995,
      "password": "0d42717f"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_100",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "28f6d888-cbc5-4210-8cd2-b40cf566d9a8"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_101",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "28f6d888-cbc5-4210-8cd2-b40cf566d9a8"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_102",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "2f63e9c9-bd96-4a0e-a097-22935d215b30"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_103",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "37f1fb58-f57c-490a-b17f-9f7db5d6c486"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_104",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "ccb3da11-e925-4eae-b666-ed6a78078c6e"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_105",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "1a5df051-c00d-4728-8ecc-a5d02f2c094e"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_106",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "377dfd01-2d1c-4c34-b2c9-e737e075595b"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_107",
      "server": "66.135.11.68",
      "server_port": 443,
      "obfs": {
        "type": "salamander",
        "password": "13f7ba5f"
      },
      "password": "4e9ee29b39a28277"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_108",
      "server": "70.34.207.153",
      "server_port": 443,
      "obfs": {
        "type": "salamander",
        "password": "d2648ec2"
      },
      "password": "18240b2dfdd76484"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_109",
      "server": "192.227.153.119",
      "server_port": 8443,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_110",
      "server": "188.68.49.1",
      "server_port": 2053,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_111",
      "server": "38.175.201.128",
      "server_port": 8443,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_112",
      "server": "94.159.109.188",
      "server_port": 8443,
      "password": "7fa1dfda-38f4-4260-88f1-df1702d676a3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_113",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "efa0dd5a-be97-469f-9679-aac4528cfbde"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_114",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "cf444a13-b002-459a-b947-1c89f0074e7e"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_115",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "3ac518d4-4917-4a91-82bb-997fa47a9778"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_116",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "c9e76d3e-ec9d-425a-9a35-83c8b4f20ef7"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_117",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "279d86c4-083c-4667-b25e-710a55f49f0d"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_118",
      "server": "176.32.33.158",
      "server_port": 1200,
      "password": "24f1bf50-3817-42e5-956a-a3af271274e1"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_119",
      "server": "176.32.35.198",
      "server_port": 8307,
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_120",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_121",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_122",
      "server": "176.32.35.194",
      "server_port": 3323,
      "password": "2a82fd04-eb1e-4fdf-b00f-96d804e6f6a6"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_123",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "d5285e2d-f110-4bd9-a15a-36febf08428d"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_124",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "e6df82d4-a551-4755-aee2-89270929280c"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_125",
      "server": "195.58.48.220",
      "server_port": 80,
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_126",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_127",
      "server": "212.192.15.239",
      "server_port": 1327,
      "password": "1f71f42b-1f07-4715-a6b6-c2c71239e924"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_128",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "8672cafa-5333-4768-b38c-032bbf820839"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_129",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "e2f90161-2f34-41c3-a144-d441199772e7"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_130",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "8497d432-2a53-4ea2-8963-a19298a9c7fb"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_131",
      "server": "103.136.68.92",
      "server_port": 3307,
      "password": "e6df82d4-a551-4755-aee2-89270929280c"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_132",
      "server": "176.32.35.194",
      "server_port": 3323,
      "password": "e6df82d4-a551-4755-aee2-89270929280c"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_133",
      "server": "176.32.35.194",
      "server_port": 3323,
      "password": "8672cafa-5333-4768-b38c-032bbf820839"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_134",
      "server": "176.32.35.194",
      "server_port": 3323,
      "password": "4f4b8d86-548e-45ee-8b1c-afc5871a8da3"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_135",
      "server": "176.32.35.194",
      "server_port": 3323,
      "password": "8497d432-2a53-4ea2-8963-a19298a9c7fb"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_136",
      "server": "176.32.35.194",
      "server_port": 3323,
      "password": "c801f576-1531-4aa0-a884-25146b988814"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_137",
      "server": "176.32.35.194",
      "server_port": 3323,
      "password": "1a998188-4dab-46ce-94f6-12f403d43e13"
    },
    {
      "type": "hysteria2",
      "tag": "2024年12月4日_138",
      "server": "195.58.48.220",
      "server_port": 80,
      "password": "4f4b8d86-548e-45ee-8b1c-afc5871a8da3"
    },
    {
      "type": "direct",
      "tag": "direct"
    },
    {
      "type": "block",
      "tag": "reject"
    },
    {
      "type": "dns",
      "tag": "dns_out"
    }
  ],
  "route": {
    "rules": [
      {
        "clash_mode": "Global",
        "outbound": "select"
      },
      {
        "clash_mode": "Direct",
        "outbound": "direct"
      },
      {
        "protocol": "dns",
        "outbound": "dns_out"
      },
      {
        "rule_set": "geosite-category-ads-all",
        "outbound": "reject"
      },
      {
        "rule_set": "geoip-cn",
        "outbound": "direct"
      },
      {
        "rule_set": "geosite-cn",
        "outbound": "direct"
      },
      {
        "ip_is_private": true,
        "outbound": "direct"
      },
      {
        "rule_set": "geosite-geolocation-!cn",
        "outbound": "select"
      }
    ],
    "rule_set": [
      {
        "type": "remote",
        "tag": "geoip-cn",
        "format": "binary",
        "url": "https://raw.githubusercontent.com/SagerNet/sing-geoip/rule-set/geoip-cn.srs",
        "download_detour": "select",
        "update_interval": "1d"
      },
      {
        "type": "remote",
        "tag": "geosite-cn",
        "format": "binary",
        "url": "https://raw.githubusercontent.com/SagerNet/sing-geosite/rule-set/geosite-cn.srs",
        "download_detour": "select",
        "update_interval": "1d"
      },
      {
        "type": "remote",
        "tag": "geosite-geolocation-!cn",
        "format": "binary",
        "url": "https://cdn.jsdelivr.net/gh/MetaCubeX/meta-rules-dat@sing/geo/geosite/geolocation-!cn.srs",
        "download_detour": "select",
        "update_interval": "1d"
      },
      {
        "type": "remote",
        "tag": "geosite-category-ads-all",
        "format": "binary",
        "url": "https://raw.githubusercontent.com/SagerNet/sing-geosite/rule-set/geosite-category-ads-all.srs",
        "download_detour": "select",
        "update_interval": "1d"
      }
    ],
    "final": "select",
    "auto_detect_interface": true
  },
  "experimental": {
    "cache_file": {
      "enabled": true,
      "path": "cache.db"
    },
    "clash_api": {
      "external_controller": "127.0.0.1:9090"
    }
  }
}
